---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitShapeVisible
source: html/2344762a-8964-1291-2064-58f2fba78bda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitShapeVisible Property

"Emit Shape Visible in Rendering"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightEmitShapeVisible { get; }
```